Reports/20220116_173105/SOAP_Listing_TestSuite/20220116_173105/requests/main/1.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2022-01-16T15:31:23.116Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <web:ListOfContinentsByName/>\n   </soapenv:Body>\n</soapenv:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "private, max-age=0"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/8.5"
        }, {
          "name" : "Vary",
          "value" : "Accept-Encoding"
        }, {
          "name" : "Web-Service",
          "value" : "DataFlex 19.1"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Date",
          "value" : "Sun, 16 Jan 2022 15:31:23 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "content" : {
          "size" : 1103,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:ListOfContinentsByNameResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:ListOfContinentsByNameResult>\r\n        <m:tContinent>\r\n          <m:sCode>AF</m:sCode>\r\n          <m:sName>Africa</m:sName>\r\n        </m:tContinent>\r\n        <m:tContinent>\r\n          <m:sCode>AN</m:sCode>\r\n          <m:sName>Antarctica</m:sName>\r\n        </m:tContinent>\r\n        <m:tContinent>\r\n          <m:sCode>AS</m:sCode>\r\n          <m:sName>Asia</m:sName>\r\n        </m:tContinent>\r\n        <m:tContinent>\r\n          <m:sCode>EU</m:sCode>\r\n          <m:sName>Europe</m:sName>\r\n        </m:tContinent>\r\n        <m:tContinent>\r\n          <m:sCode>OC</m:sCode>\r\n          <m:sName>Ocenania</m:sName>\r\n        </m:tContinent>\r\n        <m:tContinent>\r\n          <m:sCode>AM</m:sCode>\r\n          <m:sName>The Americas</m:sName>\r\n        </m:tContinent>\r\n      </m:ListOfContinentsByNameResult>\r\n    </m:ListOfContinentsByNameResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 165,
        "bodySize" : -1,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "connect" : 0,
        "ssl" : -1,
        "dns" : -1,
        "blocked" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "1",
        "testObjectId" : "Object Repository/SOAP Service/CountryInfoService/SOAP Service/CountryInfoServiceSoapBinding/ListOfContinentsByName",
        "harId" : "4e914e5f-952f-411e-ac39-2e16f19ed45b",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}